"""Задача 1
Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].
Выведите все элементы, которые меньше 5."""


def task_1():
    a_1 = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
    for t1 in a_1:
        if t1 < 5:
            print(t1)


task_1()
"""Задача 2
Даны списки:
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
Нужно вернуть список, который состоит из элементов, общих для этих двух списков."""


def task_2():
    a_2 = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
    b_2 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
    t2_list = []
    for t2_a in a_2:
        for t2_b in b_2:
            if t2_a == t2_b:
                t2_list.append(t2_a)
    print(t2_list)


task_2()
"""Задача 3
Отсортируйте словарь по значению в порядке возрастания и убывания."""


def task_3(key_reverse=False):
    d_3 = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}
    if key_reverse:
        print(sorted(d_3.values(), reverse=True))
    else:
        print(sorted(d_3.values()))


task_3(key_reverse=True)
"""Задача 4
Напишите программу для слияния нескольких словарей в один."""


def task_4():
    dict_a4 = {1: 10, 2: 20}
    dict_b4 = {3: 30, 4: 40}
    dict_c4 = {5: 50, 6: 60}
    dict_all4 = {}
    for d4 in (dict_a4, dict_b4, dict_c4):
        dict_all4.update(d4)
    print(dict_all4)

task_4()
